# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:

import pandas as pd

In [2]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
url1="https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"

customer_series= pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
customer_series2= pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")
customer_series3= pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

In [3]:
#1shapes
customer_series.shape

(4008, 11)

In [4]:
customer_series2.shape

(996, 11)

In [5]:
customer_series3.shape

(7070, 11)

In [8]:
# 2 column names
customer_series.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [6]:
customer_series2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [7]:
customer_series3.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [9]:
customer_series.dtypes

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                       float64
Monthly Premium Auto         float64
Number of Open Complaints     object
Policy Type                   object
Vehicle Class                 object
Total Claim Amount           float64
dtype: object

In [10]:
customer_series2.dtypes

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                         int64
Monthly Premium Auto           int64
Number of Open Complaints     object
Total Claim Amount           float64
Policy Type                   object
Vehicle Class                 object
dtype: object

In [11]:
customer_series3.dtypes

Customer                      object
State                         object
Customer Lifetime Value      float64
Education                     object
Gender                        object
Income                         int64
Monthly Premium Auto           int64
Number of Open Complaints      int64
Policy Type                   object
Total Claim Amount           float64
Vehicle Class                 object
dtype: object

In [12]:
customer_series.head(1)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [13]:
customer_series2.head(1)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

In [14]:
customer_series3.head(1)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [ ]:
# modifying columns

In [15]:
customer_series.columns = customer_series.columns.str.lower().str.replace(' ', '_')

In [16]:
customer_series2.columns = customer_series2.columns.str.lower().str.replace(' ', '_')

In [17]:
customer_series3.columns = customer_series3.columns.str.lower().str.replace(' ', '_')

In [30]:
customer_series.rename(columns={"State": "state"}, inplace=True)

In [31]:
customer_series2.rename(columns={"State": "state"}, inplace=True)

In [32]:
customer_series.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [33]:
customer_series_newcolumnsorder=['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount']

In [35]:
customer_series_2=customer_series2[customer_series_newcolumnsorder]

In [40]:
customer_series3=customer_series3[customer_series_newcolumnsorder]

In [65]:
customer_series.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0,94,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767,108,1/0/00,Personal Auto,Two-Door Car,566.472247

In [66]:
customer_series2.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

In [67]:
customer_series3.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,Personal Auto,Two-Door Car,499.200000
1,TB86706,Arizona,M,Master,2502.637401,0,66,0,Personal Auto,Two-Door Car,3.468912
2,ZL73902,Nevada,F,Bachelor,3265.156348,25820,82,0,Personal Auto,Four-Door Car,393.600000

In [78]:
customer_series.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                         int32
monthly_premium_auto           int32
number_of_open_complaints      int32
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [79]:
customer_series2.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                         int64
monthly_premium_auto           int64
number_of_open_complaints      int32
total_claim_amount           float64
policy_type                   object
vehicle_class                 object
dtype: object

In [80]:
customer_series3.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                         int64
monthly_premium_auto           int64
number_of_open_complaints      int64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [48]:
customer_series2["customer_lifetime_value"] = customer_series2["customer_lifetime_value"].str.replace('%', '').astype(float)

In [ ]:
#income,monthly_premium_auto  #

In [58]:
customer_series.dropna(how="all", inplace=True) # we got an error message because of nulls

In [59]:
customer_series.isna().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [60]:
customer_series['monthly_premium_auto'] = customer_series['monthly_premium_auto'].astype(int) # inter

In [61]:
 customer_series['income'] = customer_series['income'].astype(int)# inter

In [ ]:
#customer life time
customer_series["customer_lifetime_value"] = customer_series["customer_lifetime_value"].str.replace('%', '').astype(float)

In [ ]:
mean_customer_lifetime_value=customer_series["customer_lifetime_value"].mean # variable that is the mean
customer_series["customer_lifetime_value"].fillna(mean_customer_lifetime_value,inplace=True)

In [ ]:
## number_of_open_complaints     object

In [71]:
customer_series["number_of_open_complaints"]=customer_series["number_of_open_complaints"].str.split("/").str[1]

In [72]:
customer_series2["number_of_open_complaints"]=customer_series2["number_of_open_complaints"].str.split("/").str[1]

In [76]:
customer_series['number_of_open_complaints'] = customer_series['number_of_open_complaints'].astype(int)

In [77]:
customer_series2['number_of_open_complaints'] = customer_series2['number_of_open_complaints'].astype(int)

In [ ]:
### NOW i make the join

In [81]:
customer_series4=pd.concat([customer_series, customer_series2,customer_series3], axis=0)

In [82]:
customer_series4.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0,94,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767,108,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0,106,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357,68,0,Personal Auto,Four-Door Car,17.269323

In [ ]:
# eliminate all nulls

In [83]:
customer_series4.dropna(how="all", inplace=True)

In [ ]:
# Eliminate duplicatesc

In [84]:
customer_series4.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
7065    False
7066    False
7067    False
7068    False
7069    False
Length: 9137, dtype: bool

In [86]:
customer_series4.duplicated().any()

True

In [87]:
customer_series4.drop_duplicates() # first all duplicates

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6.979536e+05,0,94,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1.288743e+06,48767,108,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7.645862e+05,0,106,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5.363077e+05,36357,68,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,2.340599e+04,71941,73,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,3.096511e+03,21604,79,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,8.163890e+03,0,85,3,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,7.524442e+03,21941,96,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,2.611837e+03,0,77,0,Corporate Auto,Two-Door Car,369.600000

In [88]:
customer_series4.customer.duplicated().any() # Now for the customers as this can acct as unique indentifier

True

In [93]:
customer_series4.duplicated(subset=['customer']).sum()

81

In [94]:
customer_series4.drop_duplicates(subset=['customer'], keep='last', inplace=True)

In [98]:
# now  cleaning for colummns 
gender_mapping = {'Male': "M", "female":"F","Femal":"F"} # to the column sex i want to map the following dictionarys
customer_series4['gender'] = customer_series['gender'].map(gender_mapping)# im overrating the column values with new on. Le dices a la variable que sus valores son iguales al la variable modificada
customer_series4.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,NaN,Bachelor,697953.59,0,94,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,NaN,Bachelor,1288743.17,48767,108,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,NaN,Bachelor,764586.18,0,106,0,Corporate Auto,SUV,529.881344
5,OC83172,Oregon,NaN,Bachelor,825629.78,62902,69,0,Personal Auto,Two-Door Car,159.383042

In [100]:
customer_series4["gender"].unique()

array([nan, 'F', 'M'], dtype=object)

In [97]:
customer_series4["education"].unique()

array(['Master', 'Bachelor', 'College', 'High School or Below',
       'Bachelors', 'Doctor'], dtype=object)

In [101]:
education_mapping = {'Bachelors': "Bachelor","Master":"Master",'High School or Below':'High School or Below',"College":"College","Doctor":"Doctor"} # que cambios voy a meter 
customer_series4["education"]=customer_series["education"].map(education_mapping)
#customers series education is gonna be equal to customer series education  .map (old value:new value)

customer_series4["education"].unique()

array(['Master', nan, 'College', 'High School or Below', 'Bachelor',
       'Doctor'], dtype=object)

In [102]:
customer_series4["state"].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA'], dtype=object)

In [103]:
state_mapping={"AZ":"Arizona","Cali":"California","WA":"Washington","Nevada":"Nevada","Oregon":"Oregon"}
customer_series["state"]=customer_series["state"].map(state_mapping)
customer_series["state"].unique()

array([nan, 'Nevada', 'Oregon', 'California', 'Arizona', 'Washington'],
      dtype=object)

# Challenge 2: Structuring Data

In [122]:

import pandas as pd

In [105]:
customer_insur= pd.read_csv ("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv")

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [106]:
customer_insur.shape

(10910, 27)

In [107]:
customer_insur.head(5)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [109]:
customer_insur.dropna(how="all", inplace=True)

In [111]:
customer_insur.shape

(10910, 27)

In [126]:
customer_insur["sales_channel"].unique()

array(['Agent', 'Call Center', 'Branch', 'Web'], dtype=object)

In [128]:
customer_insur["sales_channel"].isna().any()

False

In [129]:
customer_insur["total_claim_amount"].isna().any()

False

In [134]:
customer_insur["total_claim_amount"]=customer_insur["total_claim_amount"].round(2)

In [135]:
customer_insur["total_claim_amount"].head()

0    292.80
1    744.92
2    480.00
3    484.01
4    707.93
Name: total_claim_amount, dtype: float64

In [136]:
pivot_table = pd.pivot_table(customer_insur, values='total_claim_amount', index='sales_channel', aggfunc='sum')

In [137]:
pivot_table

               total_claim_amount
sales_channel
Agent                  1810226.88
Branch                 1301204.34
Call Center             926601.02
Web                     706600.02

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [138]:
pivot_table2 = pd.pivot_table(customer_insur, values='customer_lifetime_value', index=['gender', 'education'], aggfunc='mean')

In [139]:
pivot_table2

                             customer_lifetime_value
gender education
F      Bachelor                          7874.269478
       College                           7748.823325
       Doctor                            7328.508916
       High School or Below              8675.220201
       Master                            8157.053154
M      Bachelor                          7703.601675
       College                           8052.459288
       Doctor                            7415.333638
       High School or Below              8149.687783
       Master                            8168.832659

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here